{
    "posts": [
        {
            "id": 21,
            "title": "Canada's Pledge to Empower and Protect Temporary Foreign Workers",
            "description": "Canada's Temporary Foreign Worker Program (TFWP) stands as a pivotal pillar of the nation's economy, offering Canadian employers the...",
            "category": "Work",
            "author": "GGI",
            "published_date": "Sept 29, 2023",        
            "body": "<p>Canada's Temporary Foreign Worker Program (TFWP) stands as a pivotal pillar of the nation's economy, offering Canadian employers the flexibility to welcome foreign labour when local talent is scarce. But this program isn't just about bolstering the workforce; it's also a testament to Canada's commitment to ensuring the well-being and security of these temporary foreign workers as they contribute to the nation's job market. In recent times, Employment and Social Development Canada (ESDC) has taken proactive and inspiring steps to enhance adherence to TFWP regulations, fostering an environment of fairness, inclusivity, and safety for all involved.</p><p><strong>Impressive Compliance Rates: A Cause for Celebration</strong></p><p>In the past fiscal year, ESDC conducted over 2,100 audits of employers actively participating in the TFWP. Remarkably, a resounding 94% of these employers were discovered to be fully compliant with the program's requirements—a testament to their unwavering dedication to adhering to the regulations. The remaining 6% were identified as non-compliant and underwent meticulous scrutiny to ensure fairness.</p><p><strong>Transparency for Accountability: A Step in the Right Direction</strong></p><p>Employers found to be in violation of TFWP conditions are openly listed on a website overseen by Immigration, Refugees and Citizenship Canada. This robust commitment to transparency and accountability ensures that all employers, regardless of their origin, are held to the same rigorous standards when hiring temporary foreign workers—a triumph for fairness and equality.</p><p><strong>Enforcing Compliance: Upholding Justice</strong></p><p>From April 1, 2022, to March 31, 2023, 116 employers were identified as non-compliant with the TFWP. The response was nothing short of swift and resolute. A staggering 93 employers faced administrative monetary penalties totaling an impressive $1.54 million for their infringements of program conditions—a clear message that justice will prevail. Additionally, 23 employers received warnings, acting as a wake-up call to align their practices with program requisites. Seven employers were temporarily banned from utilizing the program, with some encountering bans of up to five years—a powerful statement that rules and ethics will not be compromised.</p><p><strong>A Future of Progress and Opportunity</strong></p><p>The Government of Canada places a high premium on safeguarding the rights and welfare of temporary foreign workers. In this spirit, it has instituted measures to enhance employer compliance with the TFWP. As of September 2022, fresh regulations have been introduced to bolster the program's audit capabilities and elevate overall adherence. These regulations, coupled with a commitment to fairness, form a powerful duo.</p><p><strong>The Path Forward: Bright and Inclusive</strong></p><p>In the spirit of openness, the government intends to regularly provide updates on TFWP compliance endeavors on a semi-annual basis. These initiatives, alongside the newly inaugurated Migrant Worker Support Program and the TFWP Workforce Solutions Road Map, exemplify Canada's commitment to creating a just, secure, and inclusive working milieu for temporary foreign workers. As we advance, these efforts will continue to fortify the TFWP and ensure that it remains a beacon of progress and opportunity for those who contribute to Canada's prosperity. Together, we're building a brighter and more inclusive future—one that benefits all stakeholders and celebrates the diversity that defines Canada.</p>",
            "image": "/Assets/img/blogs/TFWP.png",
            "video": "https://drive.google.com/file/d/1CqfcVS7CJp9hvIUjjxUF5awOe5Yn522P/preview"
        },
        {
            "id": 20,
            "title": "Revolutionize Your Visa Journey: Discover the Mind-Blowing Automation Tools Transforming Canadian Immigration!",
            "description": "In the fast-paced world of immigration, change is the only constant, and staying ahead of the curve can mean the difference between waiting...",
            "category": "Work",
            "author": "GGI",
            "published_date": "Sept 29, 2023",        
            "body": "<p>In the fast-paced world of immigration, change is the only constant, and staying ahead of the curve can mean the difference between waiting endlessly for your work permit extension or Post-Graduation Work Permit (PGWP) and getting it approved in the blink of an eye. But guess what? The game is changing, and you won't believe how!</p><p><i>Ottawa, September 26, 2023</i> - Brace yourselves, because Immigration, Refugees and Citizenship Canada (IRCC) is unleashing a groundbreaking arsenal of automation tools to turbocharge the processing of work permit extensions and PGWP applications! If you're an aspiring immigrant or student dreaming of a Canadian future, you can't afford to miss this game-changing news.</p><p><strong>IRCC's Secret Weapon: Automation with a Heart!</strong></p><p>IRCC is on a mission to revamp its processing methods and make dreams come true faster than ever before. The secret sauce? Proven automation technologies that will sort, sift, and supercharge your applications. It's all about harnessing the power of tech to create a brighter, faster immigration system for everyone.</p><p><strongThe Magic Behind the Scenes:</strong></p><p>Automated Sorting and Assignment: Imagine a world where monotonous paperwork tasks are a thing of the past! IRCC's cutting-edge tools will take care of the clerical heavy lifting, allowing immigration officers to channel their energy into what truly matters - assessing your application. These nifty tools will follow carefully crafted rules set by IRCC officers, ensuring your documents land on the right desk, right away.</p><p>Effortless Eligibility Assessment: No more waiting in the queue! The automation tools will identify routine applications for a streamlined process, giving your visa application the boost it deserves. With criteria developed by IRCC officers, these tools will fast-track the eligibility check, and if you're a fit, your application will zoom ahead to the final decision stage. It's like a golden ticket to Canada!</p><p><strong>A Promise of Responsibility and Privacy:</strong></p><p>IRCC isn't playing with fire. They're committed to responsible tech implementation that respects your privacy and human rights. In line with Canada's Treasury Board Directive on Automated Decision-Making, they've conducted a meticulous Algorithmic Impact Assessment (AIA). Rest assured, these tools are designed to minimize risks, including potential discriminatory impacts, while prioritizing your privacy and security. Plus, remember, these automated wizards don't refuse your application – only a real-life IRCC officer can do that!</p><p>So, are you ready for the immigration revolution of a lifetime? Say goodbye to endless waiting, and get ready to embrace the future of hassle-free visa processing. Your Canadian dream is just a click away!</p>",
            "image": "/Assets/img/blogs/Automation Tools.png",
            "video": "https://drive.google.com/file/d/1CRszi2ygZfUUkIuy3OGbyXLa4XMUSjoZ/preview"
        },
        {
            "id": 19,
            "title": "Canada Takes Bold Strides to Enhance Affordability with New Legislation",
            "description": "Canada's Finance Minister, Chrystia Freeland, has unveiled an exciting plan aimed at enhancing affordability across the country. Introducing...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Sept 29, 2023",        
            "body": "<p>Canada's Finance Minister, Chrystia Freeland, has unveiled an exciting plan aimed at enhancing affordability across the country. Introducing Bill C-56, known as the Affordable Housing and Groceries Act, this comprehensive legislation encompasses several initiatives designed to put more money back into the hands of Canadians while fostering vibrant competition in crucial sectors.</p><p><strong>Pioneering Affordable Housing Solutions</strong></p><p>At the heart of Bill C-56 lies an adjustment to the Excise Tax Act, poised to have a transformative impact on affordable housing. Under this fresh legal framework, an enhancement to the GST New Residential Rental Property Rebate seeks to invigorate builders to invest in the development of new rental properties. The objective is crystal clear: to supercharge the supply of rental accommodations in Canada and, in doing so, drive down rental costs.</p><p>So, what's the boon for builders? It's substantial news. The revamped GST Rental Rebate elevates the rebate rate from a modest 36 per cent to an impressive 100 per cent, liberating the previous phase-out thresholds and streamlining the qualification process for new rental housing projects. This bold initiative is set to make renting more financially feasible for Canadians, especially in major urban centers where rental expenses have surged.</p><p><strong>Alleviating Rental Pressures</strong></p><p>For many Canadians and newcomers alike, the dream of homeownership has appeared increasingly unattainable due to the shortage of reasonably priced housing. With the average cost of a home surpassing $600,000, as reported by the Canadian Real Estate Association, the prospect of owning a house has remained elusive for many. The average cost of renting a one-bedroom apartment in Canada stands at $2,117. This substantial financial burden has posed a significant challenge for newcomers to Canada, who often require rental housing as they embark on their new journeys.</p><p><strong>Empowering Equitable Competition</strong></p><p>Bill C-56 goes beyond addressing housing concerns; it also introduces crucial modifications to the Competition Act, with the aim of fostering a fairer and more competitive marketplace. These adjustments empower the Competition Bureau to take action when industries engage in unfair practices, such as price manipulation and unwarranted price increases—matters that directly impact consumers' finances.</p><p>The removal of the 'efficiencies defense'g is another significant stride forward. This signifies a commitment to curtailing anti-competitive mergers that lead to higher prices and fewer choices for Canadian consumers. With this alteration, the Competition Bureau gains the authority to obstruct collaborations that hinder competition and consumer options.</p><p>By preventing mergers and partnerships that stifle competition, Canada is nurturing an environment where prices either remain competitive or decrease to attract and retain customers. This not only benefits consumers but also encourages businesses to provide superior services at affordable rates.</p><p>In conclusion, Canada's Affordable Housing and Groceries Act, encapsulated in Bill C-56, represents a forward-thinking, resolute move toward a more affordable and competitive future. It seeks to make housing more accessible, particularly for newcomers, while championing fair competition to the delight of consumers. With these initiatives in place, Canadians can anticipate a brighter and more budget-friendly future.</p>",
            "image": "/Assets/img/blogs/New Legislation.png",
            "video": "https://drive.google.com/file/d/1PqW4_IgoWS7K3n-v91gndMHT9vPkb5sM/preview"
        },
        {
            "id": 18,
            "title": "Canada's Welcoming Express Entry Draw for Agriculture: A Remarkably Low CRS Threshold Opens New Doors",
            "description": "In a milestone development, Immigration Refugees and Citizenship Canada (IRCC) is sowing the seeds of opportunity with the issuance of 600...",
            "category": "Visit",
            "author": "GGI",
            "published_date": "Sept 28, 2023",        
            "body": "<p>In a milestone development, Immigration Refugees and Citizenship Canada (IRCC) is sowing the seeds of opportunity with the issuance of 600 Invitations to Apply (ITAs) in a groundbreaking category-based Express Entry draw tailored exclusively for agriculture and agri-food occupations. While the draw is already historic in its own right, what's truly exciting is the remarkably low Comprehensive Ranking System (CRS) score requirement of just 354.</p><p><strong>A Low CRS Score: A Fresh Breeze of Hope</strong></p><p>For aspiring candidates eyeing a future in Canada's flourishing agriculture and agri-food sector, this Express Entry draw is nothing short of a game-changer. With a minimum CRS score requirement that stands at a mere 354, the doors to a new life in Canada are swinging wide open, welcoming skilled professionals with open arms.</p><p><strong>IRCC's Vision: Growing Talent in Agriculture</strong></p><p>IRCC's strategic decision to focus on individuals with experience in agriculture and agri-food-related roles, including agricultural service contractors, farm supervisors, and retail and wholesale butchers, is a testament to the Canadian government's unwavering commitment to nurturing this vital sector. By prioritizing these specialized occupations, Canada is setting the stage for agricultural growth and innovation, poised to draw in the talent needed to cultivate a brighter future across the nation.</p><p><strong>Agriculture: The Powerhouse Industry</strong></p><p>Canada's agriculture and agri-food industry is in the midst of an extraordinary boom, having exported nearly $92.8 billion in agriculture and food products globally in 2022. This remarkable achievement not only contributes to the country's economic growth but also reinforces its reputation as a global agricultural leader.</p><p>The introduction of the Express Entry draw for agriculture and agri-food occupations is not just a nod to the past accomplishments of the sector but also a forward-looking move to secure its future prosperity. By extending a warm welcome to skilled professionals who possess the expertise needed to thrive in this dynamic field, Canada is reaffirming its commitment to sustaining the upward trajectory of its agricultural industry.</p><p><strong>A Week of Opportunities</strong></p><p>Today's Express Entry draw is the third in a series of exciting events this week. Just yesterday, on September 27, 500 candidates with a minimum CRS score of 472 received invitations from the French-speaking proficiency category, highlighting Canada's embrace of linguistic diversity.</p><p>On September 26, an impressive 3,000 candidates were invited in an all-program draw with a minimum CRS score of 504, underscoring Canada's determination to attract talented individuals across a wide spectrum of industries.</p><p>In conclusion, the introduction of this specialized Express Entry draw for agriculture and agri-food occupations is a beacon of hope for skilled professionals worldwide. With a CRS score requirement as low as 354, Canada is sending a resounding message of welcome, opening doors to a bright and prosperous future for the agriculture and agri-food sector. This initiative not only celebrates the sector's achievements but also sets the stage for even greater success on the horizon. Canada's commitment to growth, innovation, and prosperity shines brightly, offering a warm and inviting embrace to those ready to contribute to its agricultural legacy.</p>",
            "image": "/Assets/img/blogs/EE Agriculture.jpg",
            "video": ""
        },
        {
            "id": 17,
            "title": "Canadian Citizenship Takes a Digital Leap: Your Oath with the Click of a Button?",
            "description": "In a move that has sparked both excitement and controversy, Canada's immigration minister is exploring the possibility of allowing new citizens...",
            "category": "Visit",
            "author": "GGI",
            "published_date": "Sept 28, 2023",        
            "body": "<p>In a move that has sparked both excitement and controversy, Canada's immigration minister is exploring the possibility of allowing new citizens to take their oath of citizenship online. While there are no immediate plans to implement this change, it has generated significant public interest.</p><p><strong>Addressing Accessibility</strong></p><p>The proposal aims to make the citizenship process more accessible, particularly for those in remote or rural communities. For individuals living far from citizenship ceremony locations, this digital option could eliminate the need for long journeys.</p><p><strong>Saving Time and Increasing Efficiency</strong></p><p>One of the key benefits of this digital shift is the potential to reduce processing times. It could save new citizens up to three months of waiting between passing their citizenship test and officially becoming Canadian. For many, this time-saving aspect is a welcome change.</p><p><strong>Public Opinion Divided</strong></p><p>However, public opinion on this matter is deeply divided. Some see it as a progressive and forward-thinking approach that aligns with the realities of the 21st century. They argue that it provides flexibility, especially for those facing challenges like time off work.</p><p><strong>Preserving Tradition</strong></p><p>On the other side of the debate are those who believe that such a change would cheapen the significance of the citizenship ceremony. They argue that it's an important tradition that shouldn't be replaced with a simple click.</p><p><strong>Concerns and Benefits</strong></p><p>While concerns about potential fraud and the loss of the ceremony's solemnity have been voiced, supporters emphasize the practical advantages, especially for those in urgent need of Canadian passports for travel.</p><p><strong>Stay Tuned for Updates</strong></p><p>As discussions continue, the fate of this digital citizenship oath remains uncertain. It's a topic that sparks strong emotions and raises essential questions about the intersection of tradition and technology in the modern world. Stay tuned for further developments on this evolving issue.</p>",
            "image": "/Assets/img/blogs/EE Digital Leap.png",
            "video": "https://drive.google.com/file/d/1WDj8sON_WKsY5Mr86ys7baJl2nH2uLVb/preview"
        },
        {
            "id": 16,
            "title": "Anticipating Record-Low CRS Scores: Canada's Response to the Agriculture Labour Shortage",
            "description": "In the ever-evolving landscape of Canadian immigration, one announcement has set the stage for what could be a historic moment. The...",
            "category": "Visit",
            "author": "GGI",
            "published_date": "Sept 28, 2023",        
            "body": "<p>In the ever-evolving landscape of Canadian immigration, one announcement has set the stage for what could be a historic moment. The IRCC (Immigration Refugees and Citizenship Canada) has unveiled plans for a groundbreaking Express Entry draw, one that is focused exclusively on profiles with experience in agriculture and agri-food occupations. This move is not just a significant step in the right direction but could also lead to the lowest-ever Comprehensive Ranking System (CRS) cutoff scores in a category-based draw.</p><p><strong>Addressing the Labour Shortage</strong></p><p>Canada's agriculture and agri-food sector has been grappling with a persistent labour shortage, a challenge that has taken center stage in recent times. With an aging workforce and increased demand for food production, it has become imperative to attract skilled professionals who can contribute to the sector's growth and sustainability. This Express Entry draw is a direct response to this pressing need.</p><p><strong>A Historic Turn of Events</strong><p><p>As anticipation mounts, experts in the field of Canadian immigration are making bold predictions. Given the specialized nature of this draw, with a focus on just three eligible occupations within agriculture and agri-food, it is highly likely that the CRS cutoff scores will plummet to unprecedented levels. This means that candidates with relatively lower CRS scores may find themselves receiving coveted Invitations to Apply (ITAs).</p><p><strong>What Makes this Draw Special</strong></p><p>To be eligible for this unique Express Entry round of invitations, candidates must possess a minimum of 6 months of experience in one of the specified occupations within the agriculture and agri-food industry. The government's commitment to attracting top talent in these roles is evident, and this draw is a testament to that dedication.</p><p>For those within the agriculture and agri-food sector, this is a momentous opportunity. The chance to contribute to Canada's vibrant farming and food processing industries while enjoying the country's renowned quality of life is now closer than ever. Whether you're a retail or wholesale butcher, a farm supervisor, or an agricultural service contractor, your skills and expertise are in high demand.</p><p>As we look ahead to the upcoming Agriculture and Agri-Food Express Entry draw, the future appears promising. The labour shortage in this sector is being addressed head-on, and skilled professionals can soon make their mark in Canada's thriving agriculture industry.</p><p>Stay tuned for further updates as the draw unfolds.</p>",
            "image": "/Assets/img/blogs/Record Low CRS.jpg",
            "video": ""
        },
        {
            "id": 15,
            "title": "Canada's Explosive Population Boom! The Incredible Role of Immigration Revealed – You Won't Believe the Numbers!",
            "description": "Canada has experienced its largest annual population growth since 1957, largely attributed to immigration, according to Statistics Canada.",
            "category": "Visit",
            "author": "GGI",
            "published_date": "Sept 28, 2023",        
            "body": "<p>Canada has experienced its largest annual population growth since 1957, largely attributed to immigration, according to Statistics Canada. The country's population increased by over a million people from July 2022 to July 2023, representing a remarkable 3% rise. Additionally, there was a substantial 46% surge in the number of temporary residents in Canada during the same period.</p><p>The Liberal government has consistently set record-breaking immigration targets in recent years but has not established specific limits on temporary visa holders. As a result, the estimated number of temporary residents in Canada now surpasses the Indigenous population counted in the 2021 census.<p>The increase in temporary residents was primarily driven by individuals with work visas, with international students playing a lesser role in this growth.</p>This population boom driven by immigration is significant for immigrants and those aspiring to immigrate to Canada. It indicates the country's openness to welcoming newcomers, which can lead to various opportunities for economic, cultural, and social advancement. The surge in temporary residents, particularly those with work visas, suggests a growing demand for skilled labour and underscores Canada's commitment to attracting talent from around the world. Overall, this trend bodes well for individuals seeking to make Canada their home or explore temporary opportunities within the country.</p>",
            "image": "/Assets/img/blogs/EE Immigration Surge.png",
            "video": "https://drive.google.com/file/d/1kO0sVw6QB6mkPrcRZ7Mp5Sb9yv5KsdsG/preview"
        },
        {
            "id": 14,
            "title": "IRCC Shakes Up Express Entry: French-Language Candidates Steal the Spotlight with CRS 472",
            "description": "In an exciting and double-dose of good news for immigration hopefuls, Immigration Refugees and Citizenship Canada (IRCC) has left the world...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Sept 28, 2023",        
            "body": "<p>In an exciting and double-dose of good news for immigration hopefuls, Immigration Refugees and Citizenship Canada (IRCC) has left the world buzzing with anticipation. The latest Express Entry draws have opened doors for 3,500 candidates, showcasing Canada's commitment to welcoming diverse talent from around the globe.</p><p><strong>500 French Proficiency Candidates Celebrate Success</strong></p><p>The first draw, held September 27, brought joy to 500 candidates with French language proficiency. These lucky individuals received coveted Invitations to Apply (ITAs) as part of a category-based selection process. To qualify, candidates needed a minimum Comprehensive Ranking System (CRS) score of 472. It's a celebration of linguistic diversity and a clear message that Canada values language skills.</p><p>But wait, there's more! The excitement reached its peak two days ago, September 26, when IRCC invited a whopping 3,000 candidates in an all-program draw. This draw considered candidates from each of the three programs managed under Express Entry, proving once again that Canada's doors are wide open for talented individuals.</p><p><strong>Category-Based Selection: A Game-Changer for Express Entry</strong></p><p>The introduction of category-based draws marks a significant shift in Express Entry's approach. Instead of relying solely on overall CRS scores, Canada now targets candidates based on specific attributes, including language proficiency, for some draws for Express Entry.</p><p><strong>Six Exciting Categories: Something for Everyone</strong></p><p>In order to accommodate high-demand professions and individuals with proficient French language skills, the IRCC has implemented six dynamic categories. These categories encompass a wide range of careers, spanning from healthcare and STEM fields to trades, transportation, and agriculture. This diverse selection process offers opportunities for individuals from various backgrounds and interests.</p><p>For those aspiring to make Canada their home through category-based selection, the dream is very much alive. As long as you're in the Express Entry pool and meet the minimum CRS score, your opportunity could arrive within the next 12 months.</p><p>Express Entry remains the golden ticket to Canada for economic immigration candidates. Whether you're in the Federal Skilled Worker Program (FSWP), the Federal Skilled Trades Program (FSTP), or the Canadian Experience Class (CEC), Express Entry evaluates and ranks candidates based on crucial factors like work experience, education, age, and language proficiency.</p><p>As we celebrate the success of 3,500 candidates and the innovative category-based draws, one thing is crystal clear: Canada's future is bright and filled with endless possibilities. Stay tuned for more updates!</p>",
            "image": "/Assets/img/blogs/EE France.png",
            "video": "https://drive.google.com/file/d/1E-Qe6WwHjE-CNQtMa-H55_bslF37zQ1R/preview"
        },
        {
            "id": 1,
            "title": "10 Aspiring Entrepreneurs Set to Embark on a Canadian Adventure",
            "description": "In a heartening update from the world of Canadian immigration, we're thrilled to announce that on September 25, 2023, the Entrepreneur Stream...",
            "category": "Business",
            "author": "GGI",
            "published_date": "Sept 27, 2023",        
            "body": "<p>In a heartening update from the world of Canadian immigration, we're thrilled to announce that on September 25, 2023, the Entrepreneur Stream issued a grand total of 10 coveted Invitations to Apply! This momentous occasion has opened doors to a brighter future for these fortunate individuals who are about to embark on a remarkable journey towards their Canadian dream.</p><p>So…what did it take to receive an invitation to apply? The answer is simple: your expression of interest had a score ranging from 136 to 163 by September 20, 2023. Your qualifications and aspirations have aligned perfectly with the Canadian vision, and the authorities are extending their warm welcome.</p><p>To the lucky 10, here's the fantastic news: there's no need to go through a labyrinthine process or keep the phone lines buzzing. Your journey to Canada will be streamlined, hassle-free, and exciting! Very soon, you'll find two emails inside your inbox, containing login information and clear instructions on how to proceed with your application. Get ready for an adventure of a lifetime!</p><p>What if you're not among the fortunate few this time? Fear not, because your dream remains very much alive. If your expression of interest didn't make the cut for this round, with a score below 136, it's not the end of the road. The waiting game isn't over; in fact, it's just begun. Your expression of interest will remain eligible for an invitation to apply for the next 12 months, starting from the date you first submitted it. This means your Canadian adventure is still within reach, and there's a wealth of possibilities on the horizon.</p><p>This update marks the beginning of a thrilling journey for the fortunate 10 who have received their invitations. It's a moment of celebration and anticipation for those in the Entrepreneur Stream, as Canada opens its doors wide to visionary entrepreneurs from around the world.</p><p>So, to our 10 newest invitees, congratulations! Your adventure awaits, and we can't wait to see you thrive in Canada's vibrant entrepreneurial landscape. For those still awaiting their turn, keep your spirits high because the dream is alive and well. Stay tuned for more updates!</p>",
            "image": "/Assets/img/blogs/EE 10 Entrep.png",
            "video": "https://drive.google.com/file/d/1TFZJyGxfGz4VcIdBrsA8M6IyjKipNU08/preview"
        },
        {
            "id": 2,
            "title": "Ontario's Express Entry Stream Opens Doors for Applicants with Scores Below 500",
            "description": "In an exciting development for aspiring immigrants, Ontario's Express Entry Human Capital Priorities stream has extended a warm welcome to 1696...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Sept 27, 2023",        
            "body": "<p>In an exciting development for aspiring immigrants, Ontario's Express Entry Human Capital Priorities stream has extended a warm welcome to 1696 individuals with comprehensive ranking system (CRS) scores ranging from 350 to 462. This significant shift in policy opens up new opportunities for individuals looking to settle in Ontario, Canada, particularly those with a background in healthcare. Targeted notifications of interest were sent out to potential candidates who met the specified CRS score criteria and possessed work experience in select health-related occupations.</p><p>On September 26th 2023, invitations were exclusively extended to candidates with work experience in specific National Occupational Classification (NOC) codes. To qualify for this stream, your primary NOC in your Express Entry profile must fall under one of the following categories:</p><p>NOC - 31102 - General practitioners and family physicians</p><p>NOC 31300 - Nursing coordinators and supervisors</p><p>NOC 31300 - Nursing coordinators and supervisors</p><p>NOC 31301 - Registered nurses and registered psychiatric nurses</p><p>NOC 32101 - Licensed practical nurses</p><p>NOC 33102 - Nurse aides, orderlies, and patient service associates</p><p>This brings a ray of hope for wishful immigrants who have the dream of living in Ontario. Recently people have been saying it is hard to get accepted in Ontario because they usually need a CRS score of over 500. Because of this, more and more immigrants are traveling towards the more Atlantic regions of Canada because of their less intense CRS scores. By welcoming individuals with scores as low as 350 in the CRS system, the province is sending a clear message: it values the contributions of skilled workers and professionals from around the world.</p><p>As Ontario continues to prioritize skilled immigration, the province is sure to see a brighter and more prosperous future, enriched by the talents and contributions of individuals from all corners of the globe.</p><p>For those considering a future in Ontario but haven't received an invitation yet, remember that immigration policies can change, and opportunities may arise in the future. Stay informed, keep building your skills, and remain optimistic about your dream of calling Ontario, Canada, your home.</p>",
            "image": "/Assets/img/blogs/EE Healthcare.png",
            "video": "https://drive.google.com/file/d/1BxlLsjrshcUcjuJAiLmE5c2f1iYc1XzM/preview"
        },
        {
            "id": 3,
            "title": "Express Entry Draw: Exciting News as Minimum CRS Score Takes a Dive",
            "description": "Express Entry is one of the most popular and fast pathways that skilled workers use to immigrate to Canada, hence its name. We all know that one of the...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Sept 27, 2023",
            "body": "<p>As of September 26, 2023, the latest Express Entry draw brought some exciting news for hopeful immigrants. The CRS cut-off score, which determines who receives an Invitation to Apply for permanent residence, has seen a drop, standing at 504 points. This marks a 27-point decrease from the previous draw on September 19, which had a minimum CRS score of 531. While the number of invitations issued this time may be slightly lower, this development is still generating buzz. Let's dive into what's happening!</p><p>Looking back at the journey through the pandemic and the challenges posed by the coronavirus outbreak, it's evident that Canada has been on a remarkable downward trend in terms of minimum CRS scores since 2022. Many experts and observers anticipated this trend to continue throughout 2023. Notably, unprecedented global events like the COVID-19 pandemic compelled Canada to conduct draws with lower CRS scores to facilitate the arrival of skilled workers and international students, thereby contributing to economic recovery. Additionally, there appears to be a growing demand for specific skills and occupations, prompting the government to lower CRS requirements to attract candidates with these tailored qualifications to bolster the job market and economy.</p><p>However, predicting whether this trend will persist or shift is as challenging as ever, given the multifaceted factors at play. It's a complex dance involving the Canadian economy's uncertainties, evolving immigration policies, and the ever-changing global economic landscape, influenced by both foreseen and unforeseen events.</p><p>Taking a closer look at this year's Express Entry draws across all programs, the CRS scores have been a dynamic spectacle, fluctuating between 481 and 531. There have been moments of decline followed by upward swings, with no definitive trend emerging from the scores' behavior.</p><p>One intriguing aspect that may contribute to these fluctuations is the time of year, with a special nod to the upcoming months of October, November, and December. Although not directly correlated to holiday months, but rather what the Canadian government decides to do, there is a possibility that within the next few months, Canada's economic needs can fluctuate seasonally. Certain industries or regions may require more skilled workers during these specific times of the year. So, to meet these needs, the government may decrease the CRS score requirements.</p><p>As we approach the year's end, with major holidays on the horizon and potential shifts in the Canadian economy, we could be in for a continued downward trend in the minimum CRS score. This would align with the aim of meeting labour market demands, fostering economic growth, and bridging labour gaps in certain industries as we head into the final stretch of 2023. Exciting times for those looking to make Canada their new home!</p>",
            "image": "/Assets/img/blogs/EE 2023.png",
            "video": "https://drive.google.com/file/d/11iadN1WB_CPn85r3rl2y7ETGaZaAJ1qZ/preview" 
        },
        {
            "id": 4,
            "title": "How to Get Started With Express Entry",
            "description": "Express Entry is one of the most popular and fast pathways that skilled workers use to immigrate to Canada, hence its name. We all know that one of the main FAQs regarding any immigration...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Sept 26, 2023",        
            "body": "<p>Express Entry is one of the most popular and fast pathways that skilled workers use to immigrate to Canada, hence its name. We all know that one of the main FAQs regarding any immigration program that many people look to ask is: How long is the application processing time? (a question that often has its own dedicated section on program websites).</p><p>Low and behold, Express Entry: an online system and application process catered for skilled immigrants who wish to permanently settle in Canada and take part in the economy. What makes Express Entry different from most immigration programs is its simplified and straightforward process, alongside its fairly quick processing times.</p><p>It can be streamlined into two main parts: submitting your profile and applying after receiving an invitation.</p><p>Let’s quickly elaborate on each part.</p><p>First is submitting your profile alongside the necessary required documents: language test results, educational credential assessment report, and a passport or travel document. Going back to the very beginning of the process, after ensuring that you are eligible for the program, you will be checking your score using a CRS (Comprehensive Ranking System) tool. It assesses you on the basis of your skills, education, language ability, work experience, and more. You would then gather your documents regarding the aforementioned assessments and fill out your profile. Candidates with the highest score will be sent an invitation to apply, where you will have 60 days to submit your application.</p><p>Simple, right?</p><p>Express Entry is your go-to immigration program if you’re looking for one that is fast and efficient in its processing times, working on the basis of a scoring system. It stands out as a highly advantageous immigration program for those aspiring to make Canada their new home. Its efficiency, transparency, and merit-based system make it a compelling choice. By streamlining the application process, minimizing wait times, and prioritizing candidates with the skills and qualifications that Canada seeks, Express Entry not only benefits newcomers but also contributes to the Canadian economy and society as a whole. This program offers a fair and accessible pathway for skilled individuals and their families to start a new chapter in Canada, making it a truly appealing option for those seeking a brighter future abroad.</p>",
            "image": "/Assets/img/blogs/ExpressEntry.png",
            "video": "https://drive.google.com/file/d/1mq-CZOlmnv3yGTLh1lsPKau2xT9YbTEj/preview"
        },
        {
            "id": 5,
            "title": "Unlocking Opportunities: Post-Graduate Work Permit Programs in Canada",
            "description": "Canada has become a top destination for international students seeking quality education and a boost into their preferred dream careers. These international students have the opportunity...", 
            "category": "Study",
            "author": "GGI",
            "published_date": "Sept 26, 2023",
            "body": "<p>Canada has become a top destination for international students seeking quality education and a boost into their preferred dream careers. These international students have the opportunity to obtain a Post-Graduate Work Permit to help them kick start their professional life in Canada. In this blog, we’ll explore the benefits, eligibility criteria, and application process for PGWP programs in Canada. If you’re a recent graduate from a DLI in Canada, you may want to pay attention.</p><p><strong>What is a PGWP Program?</strong></p><p>A PGWP is a permit that allows students who graduated from eligible Canadian designated learning institutions (DLIs) to obtain an open work permit. With this permit, it allows them to gain valuable Canadian work experience, and when it is gained through the PGWP Program, graduates are able to qualify for permanent residency in Canada through Express Entry. </p><p>[Express entry is an application process for skilled immigrants who want to settle in Canada permanently and take part in the economy. A designated learning institution (DLI) is a school approved by a provincial or territorial government to host international students.]</p><p>Now, “experience” is quite a broad term and does not specify what exactly can be classified as relevant experience. This is why we categorize experience in Training, Education, Experience, and Responsibilities (i.e., TEER), within categories 0, 1, 2, or 3.</p><p>These permits are also exempt from LMIAs, which, as stated in a previous blog, is a document that employers in Canada may need to get before hiring a foreign worker. With a PGWP, graduates can work full-time, part-time, or be self-employed.</p><p><strong>Application Process</strong></p><p>The first step in the application process is ensuring that you apply within 180 days of obtaining written confirmation. The application package is obtained through the IRCC website, within and outside of Canada. Two confirming documents that are required are, of course, the letter confirming the completion of study, as well as the transcript.</p><p><strong>Things to Consider</strong></p><p>There are a few things to take note of before looking to apply for a PGWP. This can include whether or not you graduated from a designated learning institution (DLI), if you completed school via distance learning, or other factors that would make you ineligible for a PGWP.</p><p><strong>Why Choose PGWP?</strong></p><p>Picture a PGWP as your gateway to the working world, transitioning from and bridging the gap between being an international student to a working employee. This open work permit not only allows for flexibility, but also allows you to gain highly valued Canadian work experience. But, the journey does not stop there: having a PGWP helps you transition into the next stage of your career and creates a pathway to permanent residency. With a possibility of obtaining a PGWP of up to three years, this extended stay allows you to continue building your career and exploring your options in Canada.</p>",
            "image": "/Assets/img/blogs/PGWD.png",
            "video": "https://drive.google.com/file/d/1X2wqPUzXvSKjRfY6TuCr2yYUt1DnQTgH/preview"
        },
        {
            "id": 6,
            "title": "Looking for a job in Canada? Canada is looking for you",
            "description": "Canadian Immigration is getting lenient on issuing work visas. Sargun Singh, managing director at Growing Globe Immigration, tells us about the current scenario of....",
            "category": "Visit",
            "author": "GGI",
            "published_date": "Sept 22, 2023",
            "body": "<p>Canadian Immigration is getting lenient on issuing work visas. Sargun Singh, managing director at Growing Globe Immigration, tells us about the current scenario of Canadian immigration.</p><p><strong>Do you think there are jobs in Canada for foreigners?</strong></p><p>Due to Covid-19 and express entry draws being at an all-time high, this points to the fact that Canada is facing acute shortage of labour in every sector. Canada is working its best to deal with these shortages by giving a lot of approvals for work permits and even has made it easier and faster for employers to get LMIA's to over come the labour shortage problem.</p><p><strong>What are the people in most demand in Canadian labour market right now?</strong></p><p>Job that are in most demand right now include cooks, chefs, host/hostesses, truck drivers, software engineers, human resources, bankers, investors, and people who speak French.</p><p><strong>What the general requirements for people who want to work in Canada?</strong></p><p>As I mentioned in my interview last time, the mandatory requirements are minimum one to two years’ of experience, ability to speak English or French (IELTS/TCF) and appropriate degree in their areas of profession.</p>",
            "image": "/Assets/img/blogs/blog_1.jpg",
            "video": ""
        },
        {
            "id": 7,
            "title": "This summer, Canada is looking for 500,000 newcomers",
            "description": "The world is once again ready to travel, and Canada is looking for temporary foreign workers, immigrants, international students, and a diversity of other people.",
            "category": "Visit",
            "author": "GGI",
            "published_date": "Jun 12, 2023",
            "body": "<p>The world is once again ready to travel, and Canada is looking for temporary foreign workers, immigrants, international students, and a diversity of other people.</p><p>In May 2022, the number of job openings in Canada reached a record high of 1,050,100. The job vacancy rate, which compares the number of vacant positions to the number of vacant and filled positions, is 5.9 percent.</p><p>As a result, Canada is actively seeking skilled workers from all over the world. It is the best time to apply for a job in Canada. However, you should be certain that you are applying with the right people. Hiring someone who has dealt with applications before, has a high success rate, and is familiar with the procedures is preferable to hiring someone whose inexperience could result in your application being rejected.</p><p>In an interview, Mr. Vinay Sachdeva, Regulated Canadian Immigration Consultant and founder of Growing Globe Immigration, and Mr. Sargun Singh, Executive Director, clarify critical facts and processes about the Canada immigration process and fees.</p><p><strong>1. What types of jobs are currently in demand in Canada for which UAE residents can apply?</strong></p><p>Canada is currently facing a labour shortage of over one million people. Truck drivers, hospitality, nurses, public support workers, physiotherapists, doctors, farm labour, administrators, manufacturing unit labour, and CNC operators are among the most in-demand jobs for UAE residents.</p><p><strong>2. What are the other immigration programs in Canada?</strong></p><p>There are several ways to immigrate to Canada. In fact, there are over a hundred different ways to apply, allowing multiple skill groups to apply to a specific program. Express Entry, Provincial Nominee Programs, Atlantic Immigration Program, Rural and Northern Immigration Pilot, Home Support Workers, Investments, and other programs are among them.</p><p><strong>3. What are the program's eligibility requirements?</strong></p><p>Canadian immigration focuses on four key factors. Age, education, language assessment, and work experience are all factors to consider. These factors are graded in terms of points, and the points determine your eligibility for various programs. You are welcome to come to our office and have your eligibility checked.</p><p><strong>4. What is the cost of obtaining a work permit or Permanent Residency in Canada?</strong></p><p>To obtain a work permit or permanent residence in Canada, you must have a genuine job offer. The process of obtaining a work permit or permanent residency can cost between AED 45,000 and AED 100,000.</p>",
            "image": "/Assets/img/blogs/blog_2.jpg",
            "video": ""
        },
        {
            "id": 8,
            "title": "Reasons for Refusal from Canada",
            "description": "Refusal of a Canada visa is the biggest obstacle for individuals who want to study, work, and settle in Canada...",
            "category": "Case Solution",
            "author": "GGI",
            "published_date": "Dec 5, 2022",
            "body": "<p><strong>Refusal of a Canada visa is the biggest obstacle for individuals who want to study, work, and settle in Canada. Numerous applicants seeking entry to Canada are denied visas each year. There are different reasons your Canadian visa application could be denied.&nbsp;</strong></p><p><br></p><p><strong>So without further ado, let's look at the top five reasons why Canada denies visa applications.</strong></p><p><br></p><p><strong>1. FAILURE TO PROVIDE ENOUGH SUPPORTING DOCUMENTS When applying for a Canadian visa, applicants will be required to submit supporting documents demonstrating that they have not provided false information. Students applying for a study permit, for instance, are required to submit a copy of their degree and transcripts. Professionals, on the other hand, must submit a reference letter detailing their work experience, hours worked, and responsibilities when applying for a work visa to Canada. Your visa could be denied if you don't provide enough evidence to back up your claims.</strong></p><p><br></p><p><strong>2. INSUFFICIENT EVIDENCE TO PROVE YOU CAN SUPPORT YOURSELF FINANCIALLY&nbsp;&nbsp;&nbsp;</strong></p><p><strong>Whether you are going to Canada for studying, working, or traveling, you will need to provide sufficient proof that you will not be a liability to Canada. You will be required to demonstrate your ability to support yourself and any accompanying family members during your stay in Canada. Your Canadian visa application may be denied if you are unable to provide the necessary documentation to support your claim. Every international student applying for a study visa to Canada must demonstrate their financial stability. They can achieve this by offering: If they have transferred money to Canada, evidence of a Canadian bank account in their name, a student or education loan from a bank, a Guaranteed Investment Certificate (GIC) from a participating Canadian financial institution, and proof that they have paid tuition and housing fees. Students applying for a student visa to Canada can check here how much they need to live on.</strong></p><p><br></p><p><strong>3. Inability to demonstrate your intention to return to your home country&nbsp;</strong></p><p><strong>When applying for a tourist visa or student visa, applicants must keep in mind that the visa is only temporary and has an expiration date. As a result, applicants are required to provide sufficient evidence of their intention to return to their home nation. They will not remain in Canada after their visa expires if they provide evidence. A visa official might dismiss your application on the off chance that he is unconvinced that you will get back to your country toward your approved stay's end. You can provide certified translations of lease agreements for your property to demonstrate your intention to return to your home nation. Let's say you're a worker traveling to Canada as a tourist. If that's the case, you can provide an employment letter stating that you are a permanent employee of the company. You can also provide documentation stating the anticipated return date to your employment.</strong></p><p><br></p><p><strong>4. Lack of evidence indicating good health:</strong></p><p><strong>&nbsp;Applicants who intend to stay in Canada for at least six months are required to undergo a medical examination. A medical exam may or may not be required for those who stay for less than six months. It depends on what they intend to accomplish. The purpose of these medical examinations is to ensure that the applicant: Does not have an infectious disease that is currently active, such as syphilis or tuberculosis, which can pose a threat to public health. Do not experience a loss of physical and mental abilities, unpredictability, or violent behavior, which can pose a threat to public safety. If the applicant is unable to pass the medical exam and demonstrate that he is in good health, his visa may be denied.</strong></p><p><br></p><p><strong>5. Moving on to the next reason why a visa was denied, the visa officer was not convinced that you intended to visit Canada. It stems from the applicant's inability to demonstrate to visa officers that he intends to travel to Canada. Immigration authorities require confirmation that your travel plans to Canada are legal and constructive. You'll need to show that you won't stay too long and are only visiting for tourism like to attend a conference or meet your family. Let's say the visa officer doesn't like your reason for going to Canada. He might deny your visa application to Canada in that case. Your previous travel experiences, such as overstaying in another country, may also have an impact on his decision.&nbsp;</strong></p><p><br></p><p><strong>Conclusion: Rejecting a visa can discourage applicants and make it more difficult to apply for another visa in Canada. These are the top five reasons for Canada visa refusal, though there are many other possible explanations. Therefore, the takeaway is to keep them in mind when you apply for your visa at the following time. If you want to reapply for a visa, you can get assistance from our skilled immigration consultant to avoid any problems with the application process.</strong></p>",
            "image": "/Assets/img/blogs/blog_8.jpg",
            "video": ""
        },
        {
            "id": 9,
            "title": "Express Entry Score",
            "description": "Before kickstarting with the why's and hows, let's try to fathom what CRS score is...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Nov 29, 2022",
            "body": "<p><strong>WHY IS THE CRS SCORE FOR EXPRESS ENTRY DECREASING?</strong></p><p><br></p><p><strong>Before kickstarting with the why’s and hows, let's try to fathom what CRS score is and how important of a role it plays. The Express Entry Comprehensive Ranking System (CRS) score is used to rank you among hundreds of thousands of people awaiting an Invitation to Apply (ITA) for permanent residency in the Express Entry pool.&nbsp;</strong></p><p><br></p><p><strong>No minimum CRS score is required to be included in the Express Entry pool. All you need is to be eligible for one of the 3 immigration programs that use Express Entry; Canadian Experience Class, Federal Skilled Worker, and Federal Skilled Trades (FST). However, since Express Entry is a points-based system, a higher CRS score means a higher chance of immigrating to Canada.</strong></p><p><br></p><p><strong>It’s used to assess your:</strong></p><p><br></p><ol><li><p><strong>skills</strong></p></li><li><p><strong>education</strong></p></li><li><p><strong>language ability</strong></p></li><li><p><strong>work experience</strong></p></li><li><p><strong>other factors</strong></p></li></ol><p><br></p><p><strong>Since the start of all-program draws on July 6th, the CRS score has been steadily declining, as we have observed with prior Express Entry draws. Since every program attracts applications, 7,500 applicants have received ITAs; this number is anticipated to rise.</strong></p><p><br></p><p><strong>Each draw has seen an increase in the number of candidates invited, although the CRS cut-off score has continuously decreased as the backlog of applications in the system is being processed. A 9-point drop from 525 to 516 in the previous draw was seen in the most recent draw. In the 230th draw, ITAs were awarded to an extra 2,750 applicants.</strong></p><p><br></p><p><strong>The following draws are anticipated to see a further decline in the CRS score. Canada will start accepting candidates based on merit starting in the first quarter of 2023.</strong></p><p><br></p><p><strong>The immigration minister will be able to invite candidates based on groupings rather than just CRS ratings under Bill C-19, which was unveiled earlier this year. Combinations of work experience in a sought-after occupation or set of occupations, linguistic ability, and educational background may be grouped together. The CRS cut-off is expected to be substantially lower compared to the general draws that we have been witnessing lately because candidates will be judged against those in their group rather than the whole Express Entry pool.</strong></p>",
            "image": "/Assets/img/blogs/blog_5.jpg",
            "video": ""
        },
        {
            "id": 10,
            "title": "TEER System",
            "description": "New Canadian TEER System The new NOC system (TEER) was announced in 2020 and made public at the beginning of 2021.TEER, or training...",
            "category": "Permanent Residency",
            "author": "GGI",
            "published_date": "Nov 29, 2022",
            "body": "<p><br></p><p><strong>New Canadian TEER System The new NOC system (TEER) was announced in 2020 and made public at the beginning of 2021.TEER, or training, education, experience, and responsibility classification, is the name of the new system. By the middle of early 2022, we can anticipate that IRCC will start implementing this change. The National Occupational Classification (NOC) system undergoes major structural revisions every ten years, which is why this change is taking place. As a result of this change, information from numerous relevant stakeholders and the existing occupational groups is examined.</strong></p><p><strong>Statistics Canada, the IRCC, and job seekers (both domestic and international) would be the primary stakeholders in this change. The TEER classification, or updated system, was developed in response to Canada's current economic climate.</strong></p><p><br></p><p><strong>The NOC is Canada's public word-related reference. It classifies employment activities in Canada to help understand how the Canadian labor market is structured, run government programs, encourage skill development, conduct research, and help Canada manage its immigration and foreign worker programs.</strong></p><p><strong>Every ten years, the federal government conducts a comprehensive review of the NOC. Consequently, the NOC is updated to reflect the Canadian labor market and economic changes. Statistics Canada and Employment and Social Development Canada (ESDC) launched NOC 2021 in September.NOC 2021 is the climax of an extensive interaction that incorporates a thorough review, investigation, and assessment of the Canadian economy.</strong></p><p><strong>Currently, NOC 2016 is used by Employment and Social Development Canada (ESDC), Immigration, Refugees and Citizenship Canada (IRCC), and Canada's provinces and territories to manage immigration and foreign worker programs. However, IRCC stated that NOC 2021 will be implemented in the fall of 2022 by both IRCC and ESDC. The federal government wants to give stakeholders, like people applying for immigration, more time to understand how NOC 2021 might affect them.</strong></p><p><br></p><p><strong>Its effect on immigrants and foreign workers NOC 2021 will have little to no effect on applications from immigrants and foreign workers.This is because their work experience will continue to meet the eligibility requirements for their preferred immigration or foreign worker program, despite changes to the NOC.However, some candidates will benefit from the changes while others will suffer.For instance, candidates may now be eligible for additional programs if their employment experience has changed.Alternately, others might find that they are as of now not qualified for a similar explanation.</strong></p><p><strong>Applications may be affected in a variety of ways at this time.Stakeholders will have to wait for IRCC and ESDC to provide additional details.The TEER system is taking the place of the skill type model, as stated by Statistics Canada, for two primary reasons.To begin, the TEER system aims to make it clear how much education and experience are required to work in a particular field.Second, Statistics Canada believes that the skill type approach leads to inaccurate distinctions between occupations with low and high levels of skill.Stakeholders should have a better understanding of the number of skills required for each job when TEER is implemented.</strong></p><p><br></p>",
            "image": "/Assets/img/blogs/blog_7.jpg",
            "video": ""
        },
        {
            "id": 11,
            "title": "OINP",
            "description": "One of the Employer Job Offer streams of the Ontario Immigrant Nominee Program (OINP), a Provincial...",
            "category": "Work",
            "author": "GGI",
            "published_date": "Nov 22, 2022",
            "body": "<p><strong>One of the Employer Job Offer streams of the Ontario Immigrant Nominee Program (OINP), a Provincial Nominee Program (PNP) run by the province of Ontario, is for international students. Foreign nationals with completed Canadian degrees and job offers from Ontario employers are the focus of the International Students stream.</strong></p><p><br></p><p><strong>Foreign workers with a job offer in a skilled occupation can apply to live and work permanently in Ontario through the Employer Job Offer: Foreign Worker stream.</strong></p><p><br></p><p><strong>Your employment offer must be in a skilled occupation at the National Occupational Classification's Skill Type 0 or Skill Level A or B. (NOC). Foreign employees both inside and outside of Canada are eligible for this stream.</strong></p><p><br></p><p><strong>Prerequisites for job offers</strong></p><p><strong>You must have a job offer from an employer in Ontario that satisfies the criteria listed below in order to be eligible under the Employer Job Offer: Foreign Worker stream.</strong></p><p><strong>1. Consistent and full-time</strong></p><p><strong>The offered position must be full-time and permanent.</strong></p><p><strong>Full-time employment requires at least 1,560 hours of the work year and 30 hours of paid work per week.</strong></p><p><strong>A permanent position must have no expiration date (also known as an indeterminate duration). Seasonal and/or contract-based job offers are not eligible.</strong></p><p><br></p><p><strong>2. Qualifying profession</strong></p><p><strong>The position being offered must be in a skilled occupation at the National Occupational Classification's Skill Type 0 or Skill Levels A or B. (NOC).</strong></p><p><br></p><p><strong>3. Median hourly pay</strong></p><p><strong>The salary for the position must be at least as high as the median wage for that occupation in the particular region of Ontario where you will be working.</strong></p><p><strong>4. The position is crucial to the employer's operations.</strong></p><p><strong>The role must be urgently required by the operations of your employer. This means that the position must be urgently needed in order to maintain or expand current business activity, and the employment offer must be compatible with your employer's current business operations.</strong></p><p><br></p><p><strong>5. Have a job in Ontario</strong></p><p><strong>The majority of the work you complete while holding the employment offer must take place in Ontario.</strong></p>",
            "image": "/Assets/img/blogs/blog_6.jpg",
            "video": ""
        },
        {
            "id": 12,
            "title": "case study",
            "description": "Growing Globe Immigration has been known for years now...",
            "category": "Case Solution",
            "author": "GGI",
            "published_date": "Nov 08, 2022",
            "body": "<p><strong>Growing Globe Immigration has been known for years now for successfully handling those cases where things don’t seem like a cakewalk. The expertise of each member of the team is what helps the company to take up such cases and reach victorious heights.</strong></p><p><br></p><p><strong>Before we commence with the case study, let’s brief ourselves in regards to what Human capital priorities are for a better understanding of the case. The case was a complex one and to fathom how it got cleared through the embassy is something that would astound you. This case too was one of a kind.&nbsp;</strong></p><p><br></p><p><strong>Human Capital Priorities:&nbsp;</strong></p><p><br></p><p><strong>The most well-liked stream for Ontario Immigration is the Human Capital Priorities Stream, which is part of the Stream Category of the Ontario Immigration Nominee Program (OINP). In line with Canada, Express Entry System is this stream. Ontario's Human Capital Priorities Stream identifies in the Express Entry pool those eligible foreign-skilled workers who have the necessary work experience, educational credentials, language proficiency, and another potential that would allow them to establish themselves economically and settle in Ontario.</strong></p><p><br></p><p><strong>To realise their dream, all aspiring immigrants from Ontario must be accepted into the Canada Express Entry pool either through the Federal Skilled Worker Class or the Canadian Experience Class. Direct applications are not accepted for this stream</strong></p><p><br></p><p><strong>Actually, based on their Express Entry Profile, they must get a Notification of Interest (NOI) from the Ontario Provincial Nominee Program. As part of its examination of the Express Entry Pool, the OINP identifies potential applicants with at least 400 points under the Comprehensive Ranking System (CRS).</strong></p><p><br><br></p><p><strong>Case Details:</strong></p><p><strong>The age of the applicant is 40. Has done a master's and is married. His wife was the main applicant. They have relatives in Canada which acted as a plus point but age was our major concern. He is an IT specialist and the CRS score was 416. Due to the nomination, her score went up to 600. In spite of the factors which weren’t very much in favor, the team of Growing Globe Immigration was able to provide her with direct PR.&nbsp;</strong></p><p><br></p><p><strong>It wasn’t a smooth ride, but it was not impossible either. We at Growing Globe Immigration know the potential of each case and it’s the experience and determination that have helped us resolve cases that were discarded by many in the past.&nbsp;</strong></p><p><br></p><p><strong>This scenario has been described to demonstrate to you that we are capable of resolving your case and obtaining your desired outcome. We welcome and invite our clients to be a part of the Growing Globe Immigration - GGI family and value each of them greatly. The GGI team tries to forge close bonds with them. We abide by the saying, \"Your dream is our responsibility.\" This is why we put a lot of effort into helping you achieve your dream of relocating to Canada.</strong></p><p><br></p>",
            "image": "/Assets/img/blogs/blog_4.jpg",
            "video": ""
        },
        {
            "id": 13,
            "title": "growing globe immigration",
            "description": "Growing Globe Immigration provides our clients with a variety of immigration options...",
            "category": "Marketing",
            "author": "GGI",
            "published_date": "Jan 11, 2022",
            "body": "<p><strong>INTRODUCTION - GROWING GLOBE IMMIGRATION</strong></p><p><strong>Growing Globe Immigration provides our clients with a variety of immigration options that are most suited to their needs. Our company's founder, Mr. Vinay Sachdeva, is a Canadian immigrant who is a registered immigration consultant. He is committed to assisting his clients in realising their ambition of moving to Canada to live, work, study, invest, or travel there. He desires to aid individuals from all around the world in immigrating to Canada, working with Mr. Sargun Singh. Growing Globe is proud to be governed by the Immigration Consultants of Canada Regulatory Council because we uphold justice, ethics, and ideals (ICCRC).</strong></p><p><br></p><p><strong>Canada is the nation where dreams come true. Growing Globe Immigration is a group of incredibly bright and diligent individuals who value their clients' needs above all else. Our executive team possesses the expertise, zeal, and dedication needed to succeed. In the past, we have contributed to bettering lives through our commitment to developing cutting-edge products and investing in the business and its personnel.</strong></p><p><br></p><p><strong>Growing Globe Immigration was founded in the year 2019. It has not been many years since the foundation has been laid but the impact of the company’s work is immeasurable. The success rate of the company has reached heights and is continuing to do so with the hard work and consistency of our team members, along with the trust of our clients in us which means the most.&nbsp;</strong></p><p><br></p><p><strong>PR with a job offer and without, super visa, Pnp’s, express entry and visit visa, everything mentioned here has success 99.9% success rate because Growing Globe Immigration believes in transparency, which leads to expected results which is a success. This is the reason behind the expansion of Growing Globe Immigration, our success rate, and Canada is one of the best countries to live in. You dream, we will work on it. </strong></p>",
            "image": "/Assets/img/blogs/blog_3.jpg",
            "video": ""
        }
    ]
}
